// Data_generator.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "pch.h"
#include <iomanip>
#include <iostream>
#include <fstream>
#include <string>
#include <ctime>
#include <map>



using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int n;
	ofstream OutData;
	string s;
	srand(time(0));

	map<int, string> Otrasl=		//1..30
	{
		{1, "Автомобильный бизнес"},
		{2, "Гостинницы, рестораны, общепит, кейтеринг"},
		{3, "Государственные организации"},
		{4, "Добывающая отрасль"},
		{5, "ЖКХ"},
		{6, "Информационные технологии, системная интеграция, интернет"},
		{7, "Искусство, культура"},
		{8, "Лесная промышленность, деревообработка"},
		{9, "Медицина, фармацевтика, аптеки"},
		{10, "Металлургия, металлообработка"},
		{11, "Нефть и газ"},
		{12, "Образовательные учреждения"},
		{13, "Общественная деятельность, партии, благотворительность, НКО"},
		{14, "Перевозки, логистика, склад, ВЭД"},
		{15, "Продукты питания"},
		{16, "Промышленное оборудование, техника, станки и комплектующие"},
		{17, "Розничная торговля"},
		{18, "СМИ, маркетинг, реклама, BTL, PR, дизайн, продюсирование"},
		{19, "Сельское хозяйство"},
		{20, "Строительство, недвижимость, эксплуатация, проектирование"},
		{21, "Телекоммуникации, связь"},
		{22, "Товары народного потребления (непищевые)"},
		{23, "Тяжелое машиностроение"},
		{24, "Управление многопрофильными активами"},
		{25, "Услуги для бизнеса"},
		{26, "Услуги для населения"},
		{27, "Финансовый сектор"},
		{28, "Химическое производство, удобрения"},
		{29, "Электроника, приборостроение, бытовая техника, компьютеры и оргтехника"},
		{30, "Энергетика"}
	};

	map<int, string> Sex = { {1, "м"}, {2, "ж"} };

	map<int, string> Region =		//1..86
	{		
	{1,	"Республика Адыгея(Адыгея)"},
	{2,	"Республика Башкортостан"},
	{3,	"Республика Бурятия"},
	{4,	"Республика Алтай"},
	{5,	"Республика Дагестан"},
	{6,	"Республика Ингушетия"},
	{7,	"Кабардино - Балкарская Республика"},
	{8,	"Республика Калмыкия"},
	{9,	"Карачаево - Черкесская Республика"},
	{10, "Республика Карелия"},
	{11, "Республика Коми"},
	{12, "Республика Марий Эл"},
	{13, "Республика Мордовия"},
	{14, "Республика Саха(Якутия)"},
	{15, "Республика Северная Осетия - Алания"},
	{16, "Республика Татарстан(Татарстан)"},
	{17, "Республика Тыва"},
	{18, "Удмуртская Республика"},
	{19, "Республика Хакасия"},
	{20, "Чеченская Республика"},
	{21, "Чувашская Республика - Чувашия"},
	{22, "Алтайский край"},
	{23, "Краснодарский край"},
	{24,"Красноярский край"},
	{25, "Приморский край"},
	{26, "Ставропольский край"},
	{27, "Хабаровский край"},
	{28, "Амурская область"},
	{29, "Архангельская область"},
	{30, "Астраханская область"},
	{31, "Белгородская область"},
	{32, "Брянская область"},
	{33, "Владимирская область"},
	{34, "Волгоградская область"},
	{35, "Вологодская область"},
	{36, "Воронежская область"},
	{37, "Ивановская область"},
	{38, "Иркутская область"},
	{39, "Калининградская область"},
	{40, "Калужская область"},
	{41, "Камчатский край"},
	{42, "Кемеровская область"},
	{43, "Кировская область"},
	{44, "Костромская область"},
	{45, "Курганская область"},
	{46, "Курская область"},
	{47, "Ленинградская область"},
	{48, "Липецкая область"},
	{49, "Магаданская область"},
	{50, "Московская область"},
	{51, "Мурманская область"},
	{52, "Нижегородская область"},
	{53, "Новгородская область"},
	{54, "Новосибирская область"},
	{55, "Омская область"},
	{56, "Оренбургская область"},
	{57, "Орловская область"},
	{58, "Пензенская область"},
	{59, "Пермский край"},
	{60, "Псковская область"},
	{61, "Ростовская область"},
	{62, "Рязанская область"},
	{63, "Самарская область"},
	{64, "Саратовская область"},
	{65, "Сахалинская область"},
	{66, "Свердловская область"},
	{67, "Смоленская область"},
	{68, "Тамбовская область"},
	{69, "Тверская область"},
	{70, "Томская область"},
	{71, "Тульская область"},
	{72, "Тюменская область"},
	{73, "Ульяновская область"},
	{74, "Челябинская область"},
	{75, "Забайкальский край"},
	{76, "Ярославская область"},
	{77, "г.Москва"},
	{78, "Санкт - Петербург"},
	{79, "Еврейская автономная область"},
	{80, "Ненецкий автономный округ"},
	{81, "Ханты - Мансийский автономный округ - Югра"},
	{82, "Чукотский автономный округ"},
	{83, "Ямало - Ненецкий автономный округ"},
	{84, "Республика Крым"},
	{85, "Севастополь"},
	{86, "Иные территории, включая город и космодром Байконур"}
	};

	cout << "Введите количество записей" << '\n';
	cin >> n;

	OutData.open("outFile.csv", ios::app);

	OutData << "Пол;Возраст;Регион;Количество детей;Трудоустроен;Годовой доход;Отрасль" << '\n';
	for (register int i =0; i<n; i++)
	{
		s=Sex.find(1 + rand() % 2)->second + ";" + to_string(14 + rand() % 75) + ";" + Region.find(1 + rand() % 86)->second + ";" + to_string(0 + rand() % 3);

		/*OutData << "Пол - " << Sex.find(1 + rand() % 2)->second << ";Возраст - " << 14 + rand() % 75 << "Регион - " << Region.find(1 + rand() % 86)->second <<
			"Количество детей - " << 0 + rand() % 10;*/
		if ((1 + rand() % 2) == 1)
		{
			s += ";" + to_string(1) + ";" + to_string((1 + rand() % RAND_MAX)*(1+rand()%100)) + ";" + Otrasl.find(1 + rand() % 30)->second + '\n';
			//OutData << "Трудоустроен - " << 1 << "Годовой доход - " << 0 + rand() % 10000000 << "Отрасль - " << Otrasl.find(1 + rand() % 30)->second << '\n';
		}
		else
		{
			s+= ";" + to_string(0) + ";" + "0" + ";" + "NULL" + '\n';
			//OutData << "Трудоустроен - " << 0 << "Годовой доход - " << 0  << "Отрасль - " << NULL << '\n';
		}
		OutData << s;
	}
	OutData.close();
	system("pause");
}